# RemoveAllTriggers Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterRegistry..::..RemoveAllTriggers Method
UpdaterRegistry Class See Also
---
Removes all triggers associated with Updater with specified UpdaterId. Does not unregister updater.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static void RemoveAllTriggers(
	UpdaterId id
)
```

Visual Basic
---
```text
Public Shared Sub RemoveAllTriggers ( _
	id As UpdaterId _
)
```

Visual C++
---
```text
public:
static void RemoveAllTriggers(
	UpdaterId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..UpdaterId Id of specified updater
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The updater's owner's AddIn does not match the currently active AddIn. -or- RemoveAllTriggers called while executing an updater. |

# See Also
UpdaterRegistry Class
Autodesk.Revit.DB Namespace